results/vllm-bench-mxfp4-moe-np4-c16384-prefill-cacheoff/random-i1024-o1-n12-c2.log
INFO 05-10 12:46:33 [main.py:66] Unspecified platform detected, switching to CPU Platform instead.
INFO 05-10 12:46:33 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 05-10 12:46:33 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
INFO 05-10 12:46:34 [nixl_utils.py:20] Setting UCX_RCACHE_MAX_UNRELEASED to '1024' to avoid a rare memory leak in UCX when using NIXL.
WARNING 05-10 12:46:34 [nixl_utils.py:34] NIXL is not available
WARNING 05-10 12:46:34 [nixl_utils.py:44] NIXL agent config is not available
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7c5c89be6840>, trust_remote_code=True, seed=0, num_prompts=12, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=1, random_range_ratio='0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://127.0.0.1:8080', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=2, model='DeepSeek-V4-Flash-MXFP4_MOE-requant-from-Q8_0.gguf', input_len=None, output_len=None, tokenizer='/data/models/deepseek-ai/DeepSeek-V4-Flash', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=True, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['backend_server=bati.cpp', 'model=DeepSeek-V4-Flash-MXFP4_MOE-requant-from-Q8_0.gguf', 'split_mode=layer', 'server_np=4', 'ctx=16384', 'cache=off', 'gpus=8xW7900D'], result_dir='/results', result_filename='random-i1024-o1-n12-c2.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-eff1e8e3-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name='DeepSeek-V4-Flash-MXFP4_MOE-requant-from-Q8_0.gguf', lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 05-10 12:46:35 [config.py:775] Detected quantization_config.scale_fmt=ue8m0; enabling UE8M0 for DeepGEMM.
INFO 05-10 12:46:36 [utils.py:90] Sampling input_len from [1024, 1024] and output_len from [1, 1]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 2
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     12        
Failed requests:                         0         
Maximum request concurrency:             2         
Benchmark duration (s):                  144.86    
Total input tokens:                      12288     
Total generated tokens:                  12        
Request throughput (req/s):              0.08      
Output token throughput (tok/s):         0.08      
Peak output token throughput (tok/s):    4.00      
Peak concurrent requests:                4.00      
Total token throughput (tok/s):          84.91     
---------------Time to First Token----------------
Mean TTFT (ms):                          23524.86  
Median TTFT (ms):                        23557.54  
P50 TTFT (ms):                           23557.54  
P90 TTFT (ms):                           26493.57  
P95 TTFT (ms):                           29019.47  
P99 TTFT (ms):                           31346.80  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          0.00      
Median TPOT (ms):                        0.00      
P50 TPOT (ms):                           0.00      
P90 TPOT (ms):                           0.00      
P95 TPOT (ms):                           0.00      
P99 TPOT (ms):                           0.00      
---------------Inter-token Latency----------------
Mean ITL (ms):                           0.02      
Median ITL (ms):                         0.01      
P50 ITL (ms):                            0.01      
P90 ITL (ms):                            0.02      
P95 ITL (ms):                            0.05      
P99 ITL (ms):                            0.08      
----------------End-to-end Latency----------------
Mean E2EL (ms):                          23524.88  
Median E2EL (ms):                        23557.55  
P50 E2EL (ms):                           23557.55  
P90 E2EL (ms):                           26493.58  
P95 E2EL (ms):                           29019.49  
P99 E2EL (ms):                           31346.81  
==================================================